//однострочный комментарий

/* 
это многострочный
комментарий
*/

// Напишите программу, которая на вход 
// принимает число и выдаёт его квадрат (число умноженное на само себя).

// Например:
// 4 -> 16 
// -3 -> 9 
// -7 -> 49

// Задание переменной
// тип_данных имя_переменной = значение;

int number = 5; // number = 5

int result = number * number;

Console.WriteLine(result);